<template>
    <b-container class="about">
        <div class="text">
            "Сердце Севастополя" - проект социальной журналистики , который организовала Макеева Анастасия - публицист,  журналист и автор работ , поднимающих социально-острые и " неудобные " для чиновников, вопросы касательно мер поддержки социально уязвимых категорий граждан .

            В рамках проекта публикуются истории людей , которые в силу обстоятельств оказались в кризисной ситуации.

            Публикуемый в группах " Сердца " , материал , призывает обратить внимание общественности на проблемы социальной сферы ; так же публикации преследуют своей целью развитие адресной помощи в целом , и в г. Севастополь - в частности.

            НКО " Сердце Севастополя " оказывает гуманитарную , психологическую и иные виды помощи социально незащищенным слоям населения , взаимодействуя со многими социально-ориентированными общественными региональными и местными организациями , а так же с государственными департаментами и аппаратами г. Севастополя на предмет объективной поддержки людей , которые попали в беду.
        </div>

    </b-container>
</template>

<script>
    export default {
        name: 'About'
    }
</script>

<style lang="less" scoped>
    .about {
        display: flex;

        &:before {
            content: "“";
            line-height: 1rem;
            color: #ffdf5c;

            @media (min-width: 1em) {
                font-size: 2rem;
            }

            @media (min-width: 800px) {
                font-size: 5rem;
            }
        }

        &:after {
            content: "”";
            color: #ffdf5c;
            align-self: flex-end;
            line-height: 0;

            @media (min-width: 1em) {
                font-size: 2rem;
            }

            @media (min-width: 800px) {
                font-size: 5rem;
            }
        }

        .text {
            font-style: italic;
            text-align: justify;
            font-size: 1.2rem;
            line-height: 2rem;

            @media (min-width: 1em) {
                padding: 0;
            }

            @media (min-width: 800px) {
                padding: 10px;
            }
        }
    }
</style>